In [1]:
import pandas as pd

In [34]:
coursegrad = pd.read_csv(r"C:\Users\Jurgen\Desktop\PDS-Assignment-1\Assignment 2\graduates-from-university-first-degree-courses-by-type-of-course.csv",
                        na_values = "na",
                        index_col = 0)
coursegrad = coursegrad.fillna(0)
coursegrad.no_of_graduates = coursegrad.no_of_graduates.astype("int32")
coursegrad

          sex                type_of_course  no_of_graduates
year
1993    Males                     Education                0
1993    Males                  Applied Arts                0
1993    Males  Humanities & Social Sciences              481
1993    Males            Mass Communication                0
1993    Males                   Accountancy              295
...       ...                           ...              ...
2014  Females               Health Sciences              309
2014  Females        Information Technology              289
2014  Females       Architecture & Building              258
2014  Females          Engineering Sciences             1251
2014  Females                      Services              219

[660 rows x 3 columns]

In [35]:
coursegrad.dtypes

sex                object
type_of_course     object
no_of_graduates     int32
dtype: object